### Pandas basic assignment

### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [46]:
import pandas as pd
import numpy as np

In [7]:
series_Numbers = pd.Series([4,8,15,16,23,41])

In [8]:
series_Numbers

0     4
1     8
2    15
3    16
4    23
5    41
dtype: int64

In [9]:
type(series_Numbers)

pandas.core.series.Series

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [12]:
nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [16]:
series_Numbers1 = pd.Series(nums)
series_Numbers1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [17]:
type(series_Numbers1)

pandas.core.series.Series

### Q3. Create a Pandas DataFrame that contains the following data:

Name: 
Alice,
Bob,
Claire

Age :
25,
30,
27

Gender : 
Female,
Male,
Female

Then, print the DataFrame.

In [35]:
dic_Data = {
            "Name": [ "Alice", "Bob", "Claire"],
            "Age": [ 25, 30, 27],
            "Gender": [ "Female","Male","Female"]
}

In [42]:
df_Data = pd.DataFrame(dic_Data,index=None)

In [44]:
df_Data.style.hide_index()

/tmp/ipykernel_1093/3772527691.py:1: FutureWarning: this method is deprecated in favour of `Styler.hide(axis="index")`
  df_Data.style.hide_index()

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans : A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns. Where as Sereies is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.).

Series :

In [48]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
s

a   -0.881406
b    2.079413
c   -1.728817
d   -0.679310
e   -0.467748
dtype: float64

In [49]:
type(s)

pandas.core.series.Series

In [54]:
data2 = [{"a": 1, "b": 2}, {"a": 5, "b": 10, "c": 20}]

data_df = pd.DataFrame(data2)
data_df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [55]:
type(data_df)

pandas.core.frame.DataFrame

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

describe(): 
    describe() is used to generate descriptive statistics of the data in a Pandas DataFrame or Series. It summarizes central tendency and dispersion of the dataset. describe() helps in getting a quick overview of the dataset.

Example :

In [58]:
df_Data.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

By using concat() method you can merge multiple series together into DataFrame. This takes several params, for our scenario we use list that takes series to combine and axis=1 to specify merge series as columns instead of rows. Note that using axis=0 appends series to rows instead of columns.

In [60]:
# pandas Series
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

# Combine two series.
df=pd.concat([courses,fees],axis=1)

# It also supports to combine multiple series.
df=pd.concat([courses,fees,discount],axis=1)
df

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000